Tekla.Structures.Drawing.SymbolElement
The SymbolElement class represents a symbol in the Tekla Structures symbol library.

Tekla.Structures.Drawing.SymbolElement.Symbol
The symbol.

Tekla.Structures.Drawing.SymbolElement.Color
This property is the symbol color.

Tekla.Structures.Drawing.SymbolElement.TrueColor
The true color (rgb enabled) of the symbol.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.SymbolElement.Height
The symbol height (mm).

Tekla.Structures.Drawing.SymbolElement.#ctor
Creates a new symbol element instance with the default symbol.

Tekla.Structures.Drawing.SymbolElement.#ctor(Tekla.Structures.Drawing.SymbolInfo)
Creates a new symbol element instance with the given symbol.
Symbol: The symbol to be used.

Tekla.Structures.Drawing.SymbolElement.#ctor(Tekla.Structures.Drawing.SymbolInfo,Tekla.Structures.Drawing.DrawingColors,System.Double)
Creates a new symbol element instance with the given symbol, color and height.
Symbol: The symbol to be used.
Color: The symbol color to be used.
Height: The symbol height (mm) to be used.

Tekla.Structures.Drawing.SymbolElement.#ctor(Tekla.Structures.Drawing.SymbolInfo,Tekla.Structures.Drawing.TeklaDrawingColor,System.Double)
Creates a new symbol element instance with the given symbol, the RGB color and height.
Symbol: The symbol to be used.
Color: The symbol color to be used as a true RGB color.
Height: The symbol height (mm) to be used.

Tekla.Structures.Drawing.SymbolElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.SymbolElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.SymbolElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.